function [q,qd,q2d] = mixed_traj(t,C,A,B,w,N)
% ---------------------------------------------------------------------
% 该函数计算“混合轨迹”，即由有限傅里叶级数和五阶多项式组成的轨迹。
% 输入:
%   t - 需要评估（计算）轨迹的时间点
%   C - 五阶多项式的系数矩阵
%   A - 有限傅里叶级数中正弦项的系数
%   B - 有限傅里叶级数中余弦项的系数
%   w - 基频
%   N - 谐波数量
% ---------------------------------------------------------------------

nJoint = size(A, 1);

% 计算有限傅里叶级数部分的轨迹
[qh,qhd,qh2d] = fourier_series_traj(t,zeros(nJoint,1),A,B,w,N);

% 计算五阶多项式部分的轨迹
qp = C(:,1) + C(:,2).*t + C(:,3).*t.^2 + C(:,4).*t.^3 + ...
                                    C(:,5).*t.^4 + C(:,6).*t.^5;
qpd = C(:,2) + 2*C(:,3).*t + 3*C(:,4).*t.^2 + ...
                                4*C(:,5).*t.^3 + 5*C(:,6).*t.^4;
qp2d = 2*C(:,3) + 6*C(:,4).*t + 12*C(:,5).*t.^2 + 20*C(:,6).*t.^3;

% 将两部分叠加，得到最终的位置、速度和加速度
q = qh + qp;
qd = qhd + qpd;
q2d = qh2d + qp2d;
